TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_КодыПоказателейКачестваЛИМС/гкс_КодыПоказателейКачестваЛИМС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_КодыПоказателейКачестваЛИМС</name>
  <resources>
    <name>КодЛИМС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Весы</name>
    <type>
      <types>CatalogRef.гкс_ОборудованиеПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СостоянияРегистрации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.гкс_СостоянияРегистрации</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СвязьРегистрацииИТранспортногоДокумента/гкс_СвязьРегистрацииИТранспортногоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СвязьРегистрацииИТранспортногоДокумента</name>
  <comment>Транспортные документы регистрации</comment>
  <resources>
    <name>ТранспортныйДокумент</name>
    <type>
      <types>DocumentRef.гкс_ТранспортныйДокумент</types>
    </type>
  </resources>
  <resources>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_КонтрагентыНоменклатурыЛИМС/гкс_КонтрагентыНоменклатурыЛИМС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_КонтрагентыНоменклатурыЛИМС</name>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НоменклатураПЛК/гкс_НоменклатураПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НоменклатураПЛК</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Отключено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НормативнаяДокументацияНаОтборПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидЗерна</name>
    <comment>ERP-1605</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <comment>ERP-1377</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыПроб/гкс_ТипыПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыПроб</name>
  <enumValues>
    <name>Единичная</name>
  </enumValues>
  <enumValues>
    <name>Композитная</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияРегистрации</name>
  <enumValues>
    <name>Прибыл</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенБрутто</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоПоПревышениюМаксимальногоВеса</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтборуПроб</name>
  </enumValues>
  <enumValues>
    <name>ВзятыПробы</name>
  </enumValues>
  <enumValues>
    <name>РезультатыПробПолучены</name>
  </enumValues>
  <enumValues>
    <name>КачествоПринято</name>
  </enumValues>
  <enumValues>
    <name>КачествоНеПринято</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаРазрешена</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенТара</name>
  </enumValues>
  <enumValues>
    <name>Убыл</name>
  </enumValues>
  <enumValues>
    <name>НеПринято</name>
  </enumValues>
  <enumValues>
    <name>ПринятыПробы</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаРазрешена</name>
    <comment>ERP-2029</comment>
  </enumValues>
  <enumValues>
    <name>Погружен</name>
    <comment>ERP-2029</comment>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СтатусыЛабораторногоАнализа/гкс_СтатусыЛабораторногоАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СтатусыЛабораторногоАнализа</name>
  <enumValues>
    <name>ОтборПробы</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ПовторныйАнализ</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтмена</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/CommonModules/гкс_ИнтеграцияЛИМССервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Получить ответ по запросу кода пробы.
// 
// Параметры:
//  КодПробы - Строка - 
// 
// Возвращаемое значение:
//  Строка - Получить ответ по запросу кода пробы
Функция ПолучитьОтветПоЗапросуКодаПробы(КодПробы) Экспорт
	
	СтруктураОтвета	= ПолучитьСтруктуруОтветаПоКодуПробы();	
	
	Попытка
		ОбработатьЗапросПоКодуПробы(КодПробы, СтруктураОтвета);
	Исключение
		
		КраткоеПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписатьОшибкуВЖурнал("АнализПоКодуПробы", ПодробноеПредставлениеОшибки);
	
		ВызватьИсключение КраткоеПредставлениеОшибки;
	
	КонецПопытки;
		
	ПисательВJSON = ПисательВJSON();
	ЗаписатьJSON(ПисательВJSON, СтруктураОтвета, НастройкиЗаписиВJSON()); 
	
	Возврат ПисательВJSON.Закрыть();
	
КонецФункции

// Обработка запроса сервиса gks_LIMSIntegrationService.api_Samples_ExportByCode
//
// Параметры:
//  КодПробы - Строка - код пробы лабораторного анализа
//  СтруктураДанныхОтвета - Структура - см. гкс_ИнтеграцияЛИМССервер.ПолучитьСтруктуруОтветаПоКодуПробы() 
//
Процедура ОбработатьЗапросПоКодуПробы(КодПробы, СтруктураДанныхОтвета) Экспорт
	
	Если Не ЗначениеЗаполнено(КодПробы) Тогда
		ВызватьИсключение НСтр("ru='Код пробы не заполнен';");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПоКодуПробы();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	Запрос.УстановитьПараметр("КодПробы", КодПробы);
	
	Запрос.УстановитьПараметр("ОпределятьКонтрагентаПоДаннымРегистрации",
		ПолучитьФункциональнуюОпцию("гкс_ИспользоватьОпределениеКонтрагентовРегистрацииЛИМС"));			
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	УстановитьПривилегированныйРежим(Ложь);
	
	АнализПроведен = Ложь;
	// инициализация переменной. далее она перезаполняется в ОбработатьДанныеДокументФормирования
	ТипПробы = Перечисления.гкс_ТипыПроб.Композитная;
	
	ОбработатьДанныеДокументАнализа(КодПробы, СтруктураДанныхОтвета, РезультатЗапроса, АнализПроведен);
	ОбработатьДанныеДокументФормирования(КодПробы, СтруктураДанныхОтвета, РезультатЗапроса, 
											АнализПроведен, ТипПробы);
	
	ОбработатьДанныеПоказателей(КодПробы, СтруктураДанныхОтвета, РезультатЗапроса);	
	ОбработатьДанныеРегистрацииПЛК(КодПробы, СтруктураДанныхОтвета, РезультатЗапроса);
	
	ОбработатьДанныеСостоянияРегистрации(КодПробы, СтруктураДанныхОтвета, РезультатЗапроса, ТипПробы);	
											
	ОбработатьДанныеНормативнаяДокументация(КодПробы, СтруктураДанныхОтвета, РезультатЗапроса);
	
КонецПроцедуры

// Обработка запроса сервиса gks_LIMSIntegrationService.api_Samples
//
// Параметры:
// СтруктураДанныхЗапроса - Структура - см. ПолучитьСтруктуруЗапросаПоИдентификатору()
//
Процедура ОбработатьЗапросПоИдентификаторуАнализа(СтруктураДанныхЗапроса) Экспорт
	
	ДокументАнализа	= Документы.гкс_ЛабораторныйАнализ.
		ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДанныхЗапроса.id));
		
	Если Не ОбщегоНазначения.СсылкаСуществует(ДокументАнализа) Тогда
		ТекстИсключения = СтрШаблон(НСтр("ru='Документ по идентификатору %1 не найден';"), XMLСтрока(ДокументАнализа));	
		ВызватьИсключение ТекстИсключения; 
	КонецЕсли;

	ДокументАнализаОбъект = ДокументАнализа.ПолучитьОбъект();

	ЗаполнитьШапкуДокументаПоДаннымЛИМС(ДокументАнализаОбъект, СтруктураДанныхЗапроса);
	ДокументАнализаОбъект.УстановитьСвойствоПроведенияСостоянияРегистрации();
	
	ЗаполнитьПоказателиПоДаннымЛИМС(ДокументАнализаОбъект, СтруктураДанныхЗапроса);
	
	ДокументАнализаОбъект.НормативнаяСертификация = гкс_РаботаСПоказателямиНоменклатуры.
		НормативнаяСертификацияПоФактическомуКачеству(ДокументАнализаОбъект);
	
	ДокументАнализаОбъект.ПроверитьСоотвествиеКачеству();
	
	ДокументАнализаОбъект.ЗаписатьДокументПослеОбработки();
	
КонецПроцедуры

// Возвращает ответ для сервиса gks_LIMSIntegrationService.api_Samples
//
// Параметры:
// Идентификатор - Строка - GUID документа ЦБТ_ЛаборатныйАнализ
//
// ТелоЗапроса - Строка - тело http запроса
//
// Возвращаемое значение:
//  Строка - ответ в виде строки
//
Функция ПолучитьОтветПоИдентификаторуАнализа(Идентификатор, ТелоЗапроса) Экспорт
	
	ИменаСоЗначениемДата = "date,testResultDate,analisysStartDate,analisysEndDate";
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
	
	ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Истина, ИменаСоЗначениемДата, ФорматДатыJSON.ISO);
	СтруктураДанныхЗапроса = ПолучитьСтруктуруЗапросаПоИдентификатору();
	
	Для Каждого ТекЗначение Из СтруктураДанныхЗапроса Цикл
		
		ЗначениеЗапроса	= ДанныеЗапроса[ТекЗначение.Ключ];
		Если ЗначениеЗапроса = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураДанныхЗапроса.Вставить(ТекЗначение.Ключ, ЗначениеЗапроса);
		
	КонецЦикла;
	
	Результат = "ОК";
	
	Попытка
		ОбработатьЗапросПоИдентификаторуАнализа(СтруктураДанныхЗапроса);
	Исключение	
		КраткоеПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписатьОшибкуВЖурнал("АнализПоИдентификатору", ПодробноеПредставлениеОшибки);
	
		ВызватьИсключение КраткоеПредставлениеОшибки;
	
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область ЧтениеПробыПоДаннымЛИМС

Процедура ОбработатьДанныеДокументАнализа(КодПробы, СтруктураДанныхОтвета, РезультатЗапроса, АнализПроведен)
	
	ДокументАнализа = РезультатЗапроса[0].Выбрать();	
	Если ДокументАнализа.Следующий() Тогда
		
		СтруктураДанныхОтвета.id		= XMLСтрока(ДокументАнализа.Ссылка);
		СтруктураДанныхОтвета.code		= КодПробы;
		СтруктураДанныхОтвета.date		= ДокументАнализа.Дата;
		СтруктураДанныхОтвета.isDeleted	= ДокументАнализа.ПометкаУдаления;
		СтруктураДанныхОтвета.updatedOn	= ДокументАнализа.Дата;
		СтруктураДанныхОтвета.userName	= Строка(ДокументАнализа.Ответственный);
		СтруктураДанныхОтвета.fio		= СтруктураДанныхОтвета.userName;
		СтруктураДанныхОтвета.responseUserFullName = СтруктураДанныхОтвета.userName;
		
		АнализПроведен = ДокументАнализа.Проведен;
		
		СтруктураДанныхОтвета.goodId = XMLСтрока(ДокументАнализа.Номенклатура);
		СтруктураДанныхОтвета.goodName = ДокументАнализа.НоменклатураНаименование;
		СтруктураДанныхОтвета.goodName_en = ДокументАнализа.НоменклатураНаименование;
		
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru='Анализ с кодом пробы %1 не найден';"), КодПробы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьДанныеДокументФормирования(КодПробы, СтруктураДанныхОтвета, РезультатЗапроса, 
	АнализПроведен, ТипПробы)
	
	// данные формирования проб
	ДокументФормирования = РезультатЗапроса[1].Выбрать();
	Если ДокументФормирования.Следующий() Тогда
		
		ТипПробы = ДокументФормирования.ТипПробы;
		ВидПеревозки = ДокументФормирования.ВидПеревозки;
		
		СтруктураДанныхОтвета.operType = ДокументФормирования.ТипОперации;
		СтруктураДанныхОтвета.sampleTypeId = ПолучитьGUIDТипаПробы(ТипПробы);
				
		Статус = СтатусПоСостояниюДокумента(ДокументФормирования, АнализПроведен);
		
		СтруктураДанныхОтвета.status = Статус;
		
		ЭтоВнутреннийКонтрагент = ДокументФормирования.Внутригрупповой
			И (ДокументФормирования.Собственник = ДокументФормирования.Контрагент
			Или ДокументФормирования.Собственник = ДокументФормирования.ОрганизацияКонтрагента);
		
		Если ЭтоВнутреннийКонтрагент Тогда			
			СтруктураДанныхОтвета.firmID = XMLСтрока(ДокументФормирования.ОтправительПолучатель);
			СтруктураДанныхОтвета.firmName = ДокументФормирования.ОтправительПолучательНаименование;	
		Иначе
			СтруктураДанныхОтвета.firmID = XMLСтрока(ДокументФормирования.Контрагент);
			СтруктураДанныхОтвета.firmName = ДокументФормирования.КонтрагентНаименование;		
		КонецЕсли;
		
		// станция погрузки
		Если ЗначениеЗаполнено(ДокументФормирования.СтанцияПогрузки) Тогда
			СтруктураДанныхОтвета.stationID = XMLСтрока(ДокументФормирования.СтанцияПогрузки);
			СтруктураДанныхОтвета.stationName = ДокументФормирования.СтанцияПогрузкиНаименование;
		КонецЕсли;
		
		СтруктураДанныхОтвета.counterpatyID = XMLСтрока(ДокументФормирования.Собственник);
		СтруктураДанныхОтвета.counterpatyName = ДокументФормирования.СобственникНаименование;
		
		Если ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт Тогда
			СтруктураДанныхОтвета.receiptDocType = 1;
		ИначеЕсли ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль Тогда
			СтруктураДанныхОтвета.receiptDocType = 2;
		ИначеЕсли ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Судно Тогда
			СтруктураДанныхОтвета.receiptDocType = 3;
		Иначе
			СтруктураДанныхОтвета.receiptDocType = 0;
		КонецЕсли;
		
		Если ТипПробы = Перечисления.гкс_ТипыПроб.Композитная Тогда
			СтруктураДанныхОтвета.smpTypeCode = 9;
		Иначе
			СтруктураДанныхОтвета.smpTypeCode = 0;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьДанныеПоказателей(КодПробы, СтруктураДанныхОтвета, РезультатЗапроса)
	
	// данные показателей качества
	ДанныеПоказателей = РезультатЗапроса[7].Выбрать();
	Пока ДанныеПоказателей.Следующий() Цикл
		
		СтруктураСтрокиПоказателей = ПолучитьСтруктуруСтрокиПоказателя();
		
		СтруктураСтрокиПоказателей.id = "";
		СтруктураСтрокиПоказателей.sampleId = СтруктураДанныхОтвета.id ;
		СтруктураСтрокиПоказателей.qualityIndicatorCode	= ДанныеПоказателей.КодЛИМС;
		СтруктураСтрокиПоказателей.qualityIndicatorId	= XMLСтрока(ДанныеПоказателей.Показатель);
		СтруктураСтрокиПоказателей.value		= ДанныеПоказателей.Значение;
		СтруктураСтрокиПоказателей.userName 	= СтруктураДанныхОтвета.userName;
		СтруктураСтрокиПоказателей.comment		= ДанныеПоказателей.Примечание;
		СтруктураСтрокиПоказателей.updatedOn	= СтруктураДанныхОтвета.date;
		
		СтруктураДанныхОтвета.testResults.Добавить(СтруктураСтрокиПоказателей);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьДанныеРегистрацииПЛК(КодПробы, СтруктураДанныхОтвета, РезультатЗапроса)
	
	// все регистрации на ПЛК
	ДанныеРегистрации = РезультатЗапроса[8].Выбрать();
	
	МассивТранспортныхСредств = Новый Массив;
	Пока ДанныеРегистрации.Следующий() Цикл
		СтруктураДанныхОтвета.receiptIds.Добавить(XMLСтрока(ДанныеРегистрации.ДокументРегистрации));
		МассивТранспортныхСредств.Добавить(Строка(ДанныеРегистрации.ТранспортноеСредствоНаименование));
	КонецЦикла;

	СтруктураДанныхОтвета.receiptTransports = СтрСоединить(МассивТранспортныхСредств, ", ");
	
КонецПроцедуры

Процедура ОбработатьДанныеСостоянияРегистрации(КодПробы, СтруктураДанныхОтвета, РезультатЗапроса, ТипПробы)
	
	// все состояния регистрации
	СостоянияРегистрации = РезультатЗапроса[9].Выгрузить(); 
	
	КолонкаПоиска = "Состояние";
	ГотовКОтборуПроб = Перечисления.гкс_СостоянияРегистрации.ГотовКОтборуПроб;
	ЕстьСтатусГотовКОтборуПроб = Ложь;
	
	СтатусГотовКОтборуПроб = СостоянияРегистрации.Найти(ГотовКОтборуПроб, КолонкаПоиска); 
	Если СтатусГотовКОтборуПроб <> Неопределено Тогда  
		УстановитьДатыАнализа(СтруктураДанныхОтвета, СтатусГотовКОтборуПроб, ТипПробы);
		ЕстьСтатусГотовКОтборуПроб = Истина;
	КонецЕсли;
	
	ПробыВзяты = Перечисления.гкс_СостоянияРегистрации.ВзятыПробы; 
	СтатусПробыВзяты = СостоянияРегистрации.Найти(ПробыВзяты, КолонкаПоиска);
	
	Если СтатусПробыВзяты <> Неопределено Тогда
		
		СтруктураДанныхОтвета.fio = СтатусПробыВзяты.Пользователь;                                                                       
		РазрешитьВходнойКонтрольДоВзвешивания = гкс_ПриемкаТранспорта.РазрешитьВходнойКонтрольДоВзвешивания(
				СтатусПробыВзяты.ТипРегистрации, СтатусПробыВзяты.ВидПеревозки);
				
		Если РазрешитьВходнойКонтрольДоВзвешивания И Не ЕстьСтатусГотовКОтборуПроб Тогда
			УстановитьДатыАнализа(СтруктураДанныхОтвета, СтатусПробыВзяты, ТипПробы);			
		КонецЕсли;
		
	КонецЕсли;
	
	ПринятыПробы = Перечисления.гкс_СостоянияРегистрации.ПринятыПробы; 
	СтатусПринятыПробы = СостоянияРегистрации.Найти(ПринятыПробы, КолонкаПоиска); 
	Если СтатусПринятыПробы <> Неопределено Тогда
		СтруктураДанныхОтвета.finishDate = СтатусПринятыПробы.Период;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДатыАнализа(СтруктураДанныхОтвета, СтатусСостояния, ТипПробы)
	
	СтруктураДанныхОтвета.startDate = СтатусСостояния.Период;
	Если ТипПробы = Перечисления.гкс_ТипыПроб.Единичная Тогда
		СтруктураДанныхОтвета.date = СтатусСостояния.Период;
	КонецЕсли;
	
КонецПроцедуры		

Процедура ОбработатьДанныеНормативнаяДокументация(КодПробы, СтруктураДанныхОтвета, РезультатЗапроса)
	
	НормативнаяДокументация = РезультатЗапроса[10].Выбрать();
	Если НормативнаяДокументация.Следующий() Тогда
		СтруктураДанныхОтвета.smpNormDoc = НормативнаяДокументация.НормативнаяДокументацияНаОтборПроб;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьПробыПоДаннымЛИМС
 
Процедура ЗаполнитьПоказателиПоДаннымЛИМС(ДокументОбъект, СтруктураДанныхЗапроса)

	Для Каждого ТекПоказатель Из СтруктураДанныхЗапроса.testResults Цикл
		
		ЗначениеПоказателя = ТекПоказатель["value"];
		ПримечаниеПоказателя = ТекПоказатель["comment"];
		
		Если ЗначениеПоказателя = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Показатель = ПолучитьПоказательКачества1С(ТекПоказатель, ДокументОбъект.ТочкаМаршрута);
		Если Показатель.Пустая() Тогда
			Продолжить;
		КонецЕсли; 
		
		НайденнаяСтрока	= ДокументОбъект.КачественныеПоказатели.Найти(Показатель, "Показатель");
		
		Если НайденнаяСтрока = Неопределено Тогда		
			
			НайденнаяСтрока = ДокументОбъект.КачественныеПоказатели.Добавить();	
			НайденнаяСтрока.Показатель = Показатель;
			НайденнаяСтрока.ЕдиницаИзмерения = ОбщегоНазначения.
				ЗначениеРеквизитаОбъекта(Показатель, "ЕдиницаИзмерения");
				
		ИначеЕсли НайденнаяСтрока.ЭтоЗначениеВнешнейПробы Тогда				
			Продолжить;	
		КонецЕсли;
		
		НайденнаяСтрока.Значение = ЗначениеПоказателя;	
		НайденнаяСтрока.гкс_Примечание = СокрЛП(ПримечаниеПоказателя);
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ЗаполнитьШапкуДокументаПоДаннымЛИМС(ДокументОбъект, ДанныеЛИМС)
	 
	ДокументОбъект.гкс_ДатаПолученияАнализа	= ТекущаяДатаСеанса();
	
	ДокументОбъект.гкс_ДатаНачалаАнализа = ДанныеЛИМС.analisysStartDate;
	ДокументОбъект.гкс_ДатаОкончанияАнализа	= ДанныеЛИМС.analisysEndDate;
	
	Если СтрНайти(ДокументОбъект.Примечание, ДанныеЛИМС.userName) = 0 Тогда
		ДокументОбъект.Примечание = ДокументОбъект.Примечание + " " + ДанныеЛИМС.userName;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПоказательКачества1С(ОписаниеПоказателя, ТочкаМаршрута)
	
	МенеджерПоказателей = Справочники.гкс_ПоказателиАнализовНоменклатуры;
	Показатель = МенеджерПоказателей.ПустаяСсылка();
	
	ИдентификаторПоказателя	= ОписаниеПоказателя["qualityIndicatorId"];
	Если ЗначениеЗаполнено(ИдентификаторПоказателя) Тогда 		
		Показатель = МенеджерПоказателей.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПоказателя));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Показатель) Тогда
		
		КодЛИМС = ОписаниеПоказателя["qualityIndicatorCode"]; 
		КодЛИМС = ?(ЗначениеЗаполнено(КодЛИМС), КодЛИМС, "");
		
		Показатель = РегистрыСведений.гкс_КодыПоказателейКачестваЛИМС.
			ПолучитьПоказательКачестваПоКодуЛИМС(КодЛИМС, ТочкаМаршрута);
	
	КонецЕсли;
	
	Возврат Показатель;
	
КонецФункции

#КонецОбласти

#Область Прочие

Процедура ЗаписатьОшибкуВЖурнал(ИмяСобытия, ТекстОшибки)

	ИмяСобытияДляЖурнала = "ИнтеграцияЛИМС." + ИмяСобытия;
	ЗаписьЖурналаРегистрации(ИмяСобытияДляЖурнала, 
	                         УровеньЖурналаРегистрации.Ошибка, 
	                         Метаданные.HTTPСервисы.gks_LIMSIntegrationService,
	                         Неопределено,
	                         ТекстОшибки);

КонецПроцедуры

Функция ПисательВJSON()
	
	ЗаписьJSON = Новый ЗаписьJSON;	
	ПараметрыЗаписиJSON	= Новый ПараметрыЗаписиJSON();	
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	Возврат ЗаписьJSON;
	
КонецФункции

Функция НастройкиЗаписиВJSON()
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализации.СериализовыватьМассивыКакОбъекты = Ложь;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	Возврат НастройкиСериализации;
	
КонецФункции

Функция ПолучитьТекстЗапросаПоКодуПробы()
	
	// При определении кода ЛИМС для показателей качества учитывается аналитика по Весам
	// Если Аналитика по весам не указана - выбирается показатель с пустым значением весов
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛабораторныйАнализ.Ссылка КАК Ссылка,
	|	ЛабораторныйАнализ.НомерПробы КАК НомерПробы,
	|	ЛабораторныйАнализ.Дата КАК Дата,
	|	ЛабораторныйАнализ.Номер КАК Номер,
	|	ЛабораторныйАнализ.ПометкаУдаления КАК ПометкаУдаления,
	|	ЛабораторныйАнализ.Ответственный КАК Ответственный,
	|	ЛабораторныйАнализ.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(ЛабораторныйАнализ.Номенклатура) КАК НоменклатураНаименование,
	|	ЛабораторныйАнализ.Проведен КАК Проведен,
	|	ЛабораторныйАнализ.гкс_ДокументРегистрации КАК ДокументРегистрации,
	|	ВЫБОР
	|		КОГДА ЛабораторныйАнализ.Статус = ЗНАЧЕНИЕ(Перечисление.гкс_СтатусыЛабораторногоАнализа.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.гкс_СтатусыЛабораторногоАнализа.ОтборПробы)
	|		ИНАЧЕ ЛабораторныйАнализ.Статус
	|	КОНЕЦ КАК Статус
	|ПОМЕСТИТЬ ВТ_ДокументыЛабораторныйАнализ
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|ГДЕ
	|	ЛабораторныйАнализ.НомерПробы = &КодПробы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФормированиеНомераПробы.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ДокументыЛабораторныйАнализ.Статус, ЗНАЧЕНИЕ(Перечисление.гкс_СтатусыЛабораторногоАнализа.ПустаяСсылка)) КАК
	|		СтатусЛабАнализа,
	|	ФормированиеНомераПробы.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ФормированиеНомераПробы.ТипПробы КАК ТипПробы,
	|	ФормированиеНомераПробы.НомерПробы КАК НомерПробы,
	|	РегистрацияНаПЛК.ТипРегистрации КАК ТипРегистрации,
	|	ВЫБОР
	|		КОГДА &ОпределятьКонтрагентаПоДаннымРегистрации
	|			ТОГДА ЕСТЬNULL(РегистрацияНаПЛК.Собственник, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(КонтрагентыНоменклатурыЛИМС.Контрагент, ЕСТЬNULL(РегистрацияНаПЛК.Собственник,
	|			ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)))
	|	КОНЕЦ КАК Собственник,
	|	РегистрацияНаПЛК.ОтправительПолучатель КАК ОтправительПолучатель,
	|	ПРЕДСТАВЛЕНИЕ(РегистрацияНаПЛК.ОтправительПолучатель) КАК ОтправительПолучательНаименование,
	|	РегистрацияНаПЛК.Внутригрупповой КАК Внутригрупповой,
	|	ВЫБОР
	|		КОГДА НЕ ТочкиМаршрута.Ссылка ЕСТЬ NULL
	|			ТОГДА ТочкиМаршрута.КодСтанцииЖД
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.гкс_КлассификаторСтанцийЖД.ПустаяСсылка)
	|	КОНЕЦ КАК СтанцияПогрузки,
	|	ВЫБОР
	|		КОГДА НЕ ТочкиМаршрута.Ссылка ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(КлассификаторСтанцийЖД.НаименованиеПолное, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СтанцияПогрузкиНаименование,
	|	ЕСТЬNULL(КонтрагентыОрганизаций.Ссылка, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК ОрганизацияКонтрагента,
	|	РегистрацияНаПЛК.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ВЫБОР
	|		КОГДА ФормированиеНомераПробы.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
	|		И РегистрацияНаПЛК.ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)
	|			ТОГДА 0
	|		КОГДА ФормированиеНомераПробы.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Композитная)
	|		И РегистрацияНаПЛК.ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)
	|			ТОГДА 1
	|		КОГДА ФормированиеНомераПробы.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
	|		И РегистрацияНаПЛК.ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Отгрузка)
	|			ТОГДА 2
	|		КОГДА ФормированиеНомераПробы.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Композитная)
	|		И РегистрацияНаПЛК.ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Отгрузка)
	|			ТОГДА 3
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипОперации,
	|	РегистрацияНаПЛК.ВидПеревозки КАК ВидПеревозки,
	|	СостояниеТекущее.Состояние КАК ТекущееСостояние,
	|	ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации КАК ДокументРегистрации,
	|	ЕСТЬNULL(РегистрацияНаПЛК.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(РегистрацияНаПЛК.Контрагент) КАК КонтрагентНаименование,
	|	ПРЕДСТАВЛЕНИЕ(ВЫБОР
	|		КОГДА &ОпределятьКонтрагентаПоДаннымРегистрации
	|			ТОГДА ЕСТЬNULL(РегистрацияНаПЛК.Собственник, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(КонтрагентыНоменклатурыЛИМС.Контрагент, ЕСТЬNULL(РегистрацияНаПЛК.Собственник,
	|			ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)))
	|	КОНЕЦ) КАК СобственникНаименование,
	|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ФормированиеПробы
	|ИЗ
	|	Справочник.гкс_НомерПробы КАК НомераПробы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК
	|				ФормированиеНомераПробыСписокРегистраций
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних КАК СостояниеТекущее
	|					ПО РегистрацияНаПЛК.ТочкаМаршрута = СостояниеТекущее.ТочкаМаршрута
	|					И РегистрацияНаПЛК.ТипРегистрации = СостояниеТекущее.ТипРегистрации
	|					И РегистрацияНаПЛК.ВидПеревозки = СостояниеТекущее.ВидПеревозки
	|					И РегистрацияНаПЛК.Ссылка = СостояниеТекущее.ДокументРегистрации
	|					И РегистрацияНаПЛК.ТранспортноеСредство = СостояниеТекущее.ТранспортноеСредство
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК
	|						СвязьРегистрацииИТранспортногоДокумента
	|						ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ТранспортныйДокумент КАК ГКСТранспортныйДокумент
	|							ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТочкиМаршрута КАК ТочкиМаршрута
	|								ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_КлассификаторСтанцийЖД КАК КлассификаторСтанцийЖД
	|								ПО ТочкиМаршрута.КодСтанцииЖД = КлассификаторСтанцийЖД.Ссылка
	|							ПО ГКСТранспортныйДокумент.ПунктПогрузки = ТочкиМаршрута.Ссылка
	|						ПО СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент = ГКСТранспортныйДокумент.Ссылка
	|					ПО РегистрацияНаПЛК.Ссылка = СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации
	|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК КонтрагентыОрганизаций
	|					ПО РегистрацияНаПЛК.Контрагент = КонтрагентыОрганизаций.КонтрагентОрганизации
	|					И (НЕ РегистрацияНаПЛК.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_КонтрагентыНоменклатурыЛИМС КАК КонтрагентыНоменклатурыЛИМС
	|					ПО РегистрацияНаПЛК.Номенклатура = КонтрагентыНоменклатурыЛИМС.Номенклатура
	|				ПО ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|			ПО ФормированиеНомераПробы.Ссылка = ФормированиеНомераПробыСписокРегистраций.Ссылка
	|			И (ФормированиеНомераПробыСписокРегистраций.НомерСтроки = 1)
	|		ПО НомераПробы.Ссылка = ФормированиеНомераПробы.НомерПробы,
	|	ВТ_ДокументыЛабораторныйАнализ КАК ДокументыЛабораторныйАнализ
	|ГДЕ
	|	НомераПробы.Код = &КодПробы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументыЛабораторныйАнализ.Ссылка КАК ЛабораторныйАнализ,
	|	ВТ_ДокументыЛабораторныйАнализ.ДокументРегистрации КАК ДокументРегистрации,
	|	МАКСИМУМ(Взвешивание.Дата) КАК ДатаВзвешивания
	|ПОМЕСТИТЬ ВТ_ПоследниеДатыВзешиванияПоРегистрациям
	|ИЗ
	|	ВТ_ДокументыЛабораторныйАнализ КАК ВТ_ДокументыЛабораторныйАнализ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|		ПО ВТ_ДокументыЛабораторныйАнализ.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_Взвешивание КАК Взвешивание
	|		ПО ВТ_ДокументыЛабораторныйАнализ.ДокументРегистрации = Взвешивание.ДокументРегистрации
	|		И (Взвешивание.ТипВзвешивания = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыВзвешивания.Въезд))
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДокументыЛабораторныйАнализ.Ссылка,
	|	ВТ_ДокументыЛабораторныйАнализ.ДокументРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеДатыВзешиванияПоРегистрациям.ЛабораторныйАнализ КАК ЛабораторныйАнализ,
	|	МАКСИМУМ(Взвешивание.Весы) КАК Весы
	|ПОМЕСТИТЬ ВТ_СписокВесовДляЛабАнализа
	|ИЗ
	|	ВТ_ПоследниеДатыВзешиванияПоРегистрациям КАК ВТ_ПоследниеДатыВзешиванияПоРегистрациям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_Взвешивание КАК Взвешивание
	|		ПО ВТ_ПоследниеДатыВзешиванияПоРегистрациям.ДокументРегистрации = Взвешивание.ДокументРегистрации
	|		И (Взвешивание.ТипВзвешивания = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыВзвешивания.Въезд))
	|		И (Взвешивание.Дата = ВТ_ПоследниеДатыВзешиванияПоРегистрациям.ДатаВзвешивания)
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоследниеДатыВзешиванияПоРегистрациям.ЛабораторныйАнализ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ЛабораторныйАнализКачественныеПоказатели.Показатель,
	|		ЗНАЧЕНИЕ(Справочник.гкс_ПоказателиАнализовНоменклатуры.ПустаяСсылка)) КАК Показатель,
	|	ВТ_ФормированиеПробы.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВТ_ФормированиеПробы.ВидПеревозки КАК ВидПеревозки,
	|	ВТ_ФормированиеПробы.ТипРегистрации КАК ТипРегистрации,
	|	ВТ_ДокументыЛабораторныйАнализ.Номенклатура КАК Номенклатура,
	|	ВТ_ФормированиеПробы.ТипПробы КАК ТипПробы,
	|	ЕСТЬNULL(ЛабораторныйАнализКачественныеПоказатели.Значение, НЕОПРЕДЕЛЕНО) КАК Значение,
	|	ЕСТЬNULL(ЛабораторныйАнализКачественныеПоказатели.гкс_Примечание, """") КАК гкс_Примечание,
	|	ЕСТЬNULL(ВТ_СписокВесовДляЛабАнализа.Весы, ЗНАЧЕНИЕ(Справочник.гкс_ОборудованиеПЛК.ПустаяСсылка)) КАК Весы
	|ПОМЕСТИТЬ ВТ_ПоказателиКачества
	|ИЗ
	|	ВТ_ДокументыЛабораторныйАнализ КАК ВТ_ДокументыЛабораторныйАнализ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК ЛабораторныйАнализКачественныеПоказатели
	|		ПО ВТ_ДокументыЛабораторныйАнализ.Ссылка = ЛабораторныйАнализКачественныеПоказатели.Ссылка
	|		И (НЕ ЛабораторныйАнализКачественныеПоказатели.ЭтоЗначениеВнешнейПробы)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписокВесовДляЛабАнализа КАК ВТ_СписокВесовДляЛабАнализа
	|		ПО ВТ_ДокументыЛабораторныйАнализ.Ссылка = ВТ_СписокВесовДляЛабАнализа.ЛабораторныйАнализ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФормированиеПробы КАК ВТ_ФормированиеПробы
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоказателиКачества.Показатель КАК Показатель,
	|	ВТ_ПоказателиКачества.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВТ_ПоказателиКачества.ВидПеревозки КАК ВидПеревозки,
	|	ВТ_ПоказателиКачества.ТипРегистрации КАК ТипРегистрации,
	|	ВТ_ПоказателиКачества.Номенклатура КАК Номенклатура,
	|	ВТ_ПоказателиКачества.ТипПробы КАК ТипПробы,
	|	ВТ_ПоказателиКачества.Значение КАК Значение,
	|	ВТ_ПоказателиКачества.гкс_Примечание КАК Примечание,
	|	ВТ_ПоказателиКачества.Весы КАК Весы,
	|	ЕСТЬNULL(КодыПоказателейКачестваЛИМС.КодЛИМС, """") КАК КодЛИМС
	|ПОМЕСТИТЬ ВТ_ПоказателиКачестваСВесамиИБез
	|ИЗ
	|	ВТ_ПоказателиКачества КАК ВТ_ПоказателиКачества
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_КодыПоказателейКачестваЛИМС КАК КодыПоказателейКачестваЛИМС
	|		ПО ВТ_ПоказателиКачества.Показатель = КодыПоказателейКачестваЛИМС.Показатель
	|		И ВТ_ПоказателиКачества.ТочкаМаршрута = КодыПоказателейКачестваЛИМС.ТочкаМаршрута
	|		И ВТ_ПоказателиКачества.ВидПеревозки = КодыПоказателейКачестваЛИМС.ВидПеревозки
	|		И ВТ_ПоказателиКачества.ТипРегистрации = КодыПоказателейКачестваЛИМС.ТипРегистрации
	|		И ВТ_ПоказателиКачества.Номенклатура = КодыПоказателейКачестваЛИМС.Номенклатура
	|		И ВТ_ПоказателиКачества.ТипПробы = КодыПоказателейКачестваЛИМС.ТипПробы
	|		И ВТ_ПоказателиКачества.Весы = КодыПоказателейКачестваЛИМС.Весы
	|ГДЕ
	|	НЕ ВТ_ПоказателиКачества.Весы = ЗНАЧЕНИЕ(Справочник.гкс_ОборудованиеПЛК.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПоказателиКачества.Показатель,
	|	ВТ_ПоказателиКачества.ТочкаМаршрута,
	|	ВТ_ПоказателиКачества.ВидПеревозки,
	|	ВТ_ПоказателиКачества.ТипРегистрации,
	|	ВТ_ПоказателиКачества.Номенклатура,
	|	ВТ_ПоказателиКачества.ТипПробы,
	|	ВТ_ПоказателиКачества.Значение,
	|	ВТ_ПоказателиКачества.гкс_Примечание,
	|	ЗНАЧЕНИЕ(Справочник.гкс_ОборудованиеПЛК.ПустаяСсылка),
	|	ЕСТЬNULL(КодыПоказателейКачестваЛИМС.КодЛИМС, """")
	|ИЗ
	|	ВТ_ПоказателиКачества КАК ВТ_ПоказателиКачества
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_КодыПоказателейКачестваЛИМС КАК КодыПоказателейКачестваЛИМС
	|		ПО ВТ_ПоказателиКачества.Показатель = КодыПоказателейКачестваЛИМС.Показатель
	|		И ВТ_ПоказателиКачества.ТочкаМаршрута = КодыПоказателейКачестваЛИМС.ТочкаМаршрута
	|		И ВТ_ПоказателиКачества.ВидПеревозки = КодыПоказателейКачестваЛИМС.ВидПеревозки
	|		И ВТ_ПоказателиКачества.ТипРегистрации = КодыПоказателейКачестваЛИМС.ТипРегистрации
	|		И ВТ_ПоказателиКачества.Номенклатура = КодыПоказателейКачестваЛИМС.Номенклатура
	|		И ВТ_ПоказателиКачества.ТипПробы = КодыПоказателейКачестваЛИМС.ТипПробы
	|		И (КодыПоказателейКачестваЛИМС.Весы = ЗНАЧЕНИЕ(Справочник.гкс_ОборудованиеПЛК.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоказателиКачестваСВесамиИБез.Показатель КАК Показатель,
	|	ВТ_ПоказателиКачестваСВесамиИБез.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВТ_ПоказателиКачестваСВесамиИБез.ВидПеревозки КАК ВидПеревозки,
	|	ВТ_ПоказателиКачестваСВесамиИБез.ТипРегистрации КАК ТипРегистрации,
	|	ВТ_ПоказателиКачестваСВесамиИБез.Номенклатура КАК Номенклатура,
	|	ВТ_ПоказателиКачестваСВесамиИБез.ТипПробы КАК ТипПробы,
	|	ВТ_ПоказателиКачестваСВесамиИБез.Значение КАК Значение,
	|	ВТ_ПоказателиКачестваСВесамиИБез.Примечание КАК Примечание,
	|	МАКСИМУМ(ВТ_ПоказателиКачестваСВесамиИБез.Весы) КАК Весы
	|ПОМЕСТИТЬ ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС
	|ИЗ
	|	ВТ_ПоказателиКачестваСВесамиИБез КАК ВТ_ПоказателиКачестваСВесамиИБез
	|ГДЕ
	|	ВТ_ПоказателиКачестваСВесамиИБез.КодЛИМС <> """"
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПоказателиКачестваСВесамиИБез.Показатель,
	|	ВТ_ПоказателиКачестваСВесамиИБез.ТочкаМаршрута,
	|	ВТ_ПоказателиКачестваСВесамиИБез.ВидПеревозки,
	|	ВТ_ПоказателиКачестваСВесамиИБез.ТипРегистрации,
	|	ВТ_ПоказателиКачестваСВесамиИБез.Номенклатура,
	|	ВТ_ПоказателиКачестваСВесамиИБез.ТипПробы,
	|	ВТ_ПоказателиКачестваСВесамиИБез.Значение,
	|	ВТ_ПоказателиКачестваСВесамиИБез.Примечание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.Показатель КАК Показатель,
	|	ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.ВидПеревозки КАК ВидПеревозки,
	|	ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.ТипРегистрации КАК ТипРегистрации,
	|	ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.Номенклатура КАК Номенклатура,
	|	ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.ТипПробы КАК ТипПробы,
	|	ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.Значение КАК Значение,
	|	ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.Примечание КАК Примечание,
	|	ВТ_ПоказателиКачестваСВесамиИБез.КодЛИМС КАК КодЛИМС
	|ПОМЕСТИТЬ ВТ_ПоказателиКачестваИтог
	|ИЗ
	|	ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС КАК ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоказателиКачестваСВесамиИБез КАК ВТ_ПоказателиКачестваСВесамиИБез
	|		ПО ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.Показатель = ВТ_ПоказателиКачестваСВесамиИБез.Показатель
	|		И ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.ТочкаМаршрута = ВТ_ПоказателиКачестваСВесамиИБез.ТочкаМаршрута
	|		И ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.ВидПеревозки = ВТ_ПоказателиКачестваСВесамиИБез.ВидПеревозки
	|		И ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.ТипРегистрации = ВТ_ПоказателиКачестваСВесамиИБез.ТипРегистрации
	|		И ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.Номенклатура = ВТ_ПоказателиКачестваСВесамиИБез.Номенклатура
	|		И ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.ТипПробы = ВТ_ПоказателиКачестваСВесамиИБез.ТипПробы
	|		И ВТ_ВесыПоказателейКачестваСЗаполненнымКодомЛИМС.Весы = ВТ_ПоказателиКачестваСВесамиИБез.Весы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации,
	|		ЗНАЧЕНИЕ(Документ.гкс_РегистрацияНаПЛК.ПустаяСсылка)) КАК ДокументРегистрации,
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(РегистрацияНаПЛК.ТранспортноеСредство,
	|		ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка))) КАК ТранспортноеСредствоНаименование
	|ПОМЕСТИТЬ ВТ_ВсеРегистрации
	|ИЗ
	|	ВТ_ФормированиеПробы КАК ВТ_ФормированиеПробы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|		ПО ВТ_ФормированиеПробы.Ссылка = ФормированиеНомераПробыСписокРегистраций.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|		ПО (ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации = РегистрацияНаПЛК.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(СостоянияРегистрации.МестнаяДата) КАК Период,
	|	СостоянияРегистрации.Состояние КАК Состояние,
	|	ПРЕДСТАВЛЕНИЕ(СостоянияРегистрации.Пользователь) КАК Пользователь,
	|	МАКСИМУМ(СостоянияРегистрации.ВидПеревозки) КАК ВидПеревозки,
	|	МАКСИМУМ(СостоянияРегистрации.ТипРегистрации) КАК ТипРегистрации
	|ПОМЕСТИТЬ ВТ_ВсеСостоянияРегистрации
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации КАК СостоянияРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ФормированиеПробы КАК ВТ_ФормированиеПробы
	|		ПО СостоянияРегистрации.ТочкаМаршрута = ВТ_ФормированиеПробы.ТочкаМаршрута
	|		И СостоянияРегистрации.ТипРегистрации = ВТ_ФормированиеПробы.ТипРегистрации
	|		И СостоянияРегистрации.ВидПеревозки = ВТ_ФормированиеПробы.ВидПеревозки
	|		И СостоянияРегистрации.ДокументРегистрации = ВТ_ФормированиеПробы.ДокументРегистрации
	|		И СостоянияРегистрации.ТранспортноеСредство = ВТ_ФормированиеПробы.ТранспортноеСредство
	|СГРУППИРОВАТЬ ПО
	|	СостоянияРегистрации.Состояние,
	|	ПРЕДСТАВЛЕНИЕ(СостоянияРегистрации.Пользователь)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(НоменклатураПЛКСрезПоследних.НормативнаяДокументацияНаОтборПроб, """") КАК НормативнаяДокументацияНаОтборПроб
	|ПОМЕСТИТЬ ВТ_НормативнаяДокументация
	|ИЗ
	|	ВТ_ФормированиеПробы КАК ВТ_ФормированиеПробы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_НоменклатураПЛК.СрезПоследних КАК НоменклатураПЛКСрезПоследних
	|		ПО ВТ_ФормированиеПробы.ТочкаМаршрута = НоменклатураПЛКСрезПоследних.ТочкаМаршрута
	|		И ВТ_ФормированиеПробы.ВидПеревозки = НоменклатураПЛКСрезПоследних.ВидПеревозки
	|		И ВТ_ФормированиеПробы.Номенклатура = НоменклатураПЛКСрезПоследних.Номенклатура
	|		И (НоменклатураПЛКСрезПоследних.ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка))";
	 
КонецФункции 
 
Функция ПолучитьСтруктуруОтветаПоКодуПробы()
	
	ПустаяДата = гкс_ОбщегоНазначенияКлиентСервер.ПустаяДата();
		
	Результат = Новый Структура;
	
	Результат.Вставить("id", "00000000-0000-0000-0000-000000000000");
	Результат.Вставить("code", "");
	Результат.Вставить("date", ПустаяДата);
	Результат.Вставить("testResultDate", ПустаяДата);
	Результат.Вставить("isDeleted", Ложь);
	Результат.Вставить("updatedOn", ПустаяДата);
	Результат.Вставить("userName", "");
	Результат.Вставить("labFirmId", "00000000-0000-0000-0000-000000000000");
	Результат.Вставить("operType", 0);
	Результат.Вставить("sampleTypeId", "00000000-0000-0000-0000-000000000000");
	Результат.Вставить("samplePackageTypeId", "00000000-0000-0000-0000-000000000000");
	Результат.Вставить("fio", "");
	Результат.Вставить("testResults", Новый Массив);
	Результат.Вставить("status", 0);
	Результат.Вставить("receiptIds", Новый Массив);
	Результат.Вставить("goodId", "00000000-0000-0000-0000-000000000000");
	Результат.Вставить("goodName", "");
	Результат.Вставить("goodName_en", "");
	Результат.Вставить("startDate", ПустаяДата);
	Результат.Вставить("finishDate", ПустаяДата);
	Результат.Вставить("analisysStartDate", ПустаяДата);
	Результат.Вставить("analisysEndDate", ПустаяДата);
	Результат.Вставить("responseUserFullName", "");
	Результат.Вставить("firmID", "00000000-0000-0000-0000-000000000000");
	Результат.Вставить("firmName", "");
	Результат.Вставить("stationID", "00000000-0000-0000-0000-000000000000");
	Результат.Вставить("stationName", "");
	Результат.Вставить("counterpatyID", "00000000-0000-0000-0000-000000000000");
	Результат.Вставить("counterpatyName", "");
	Результат.Вставить("receiptTransports", "");
	Результат.Вставить("receiptDocType", 0);
	Результат.Вставить("goodPackingCode", "01");
	Результат.Вставить("smpTypeCode", "");
	Результат.Вставить("smpNormDoc", "");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруСтрокиПоказателя()
	
	Результат	= Новый Структура;
	
	Результат.Вставить("id", "");
	Результат.Вставить("sampleId", "00000000-0000-0000-0000-000000000000");
	Результат.Вставить("qualityIndicatorCode", "");
	Результат.Вставить("qualityIndicatorId", "00000000-0000-0000-0000-000000000000");
	Результат.Вставить("value", 0);
	Результат.Вставить("userName", "");
	Результат.Вставить("comment", "");
	Результат.Вставить("order", 0);
	Результат.Вставить("updatedOn", Дата(1,1,1,0,0,0));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьGUIDТипаПробы(ТипПробы)
	
	Если ТипПробы = Перечисления.гкс_ТипыПроб.Единичная Тогда
		Возврат "5e5be7b3-be4f-474f-82be-94748485d6b4";
	Иначе
		Возврат "68b83ae1-cb26-460c-b9ec-a816ce5ad2a2";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтруктуруЗапросаПоИдентификатору()
	
	Результат	= Новый Структура;
	
	Результат.Вставить("id", "00000000-0000-0000-0000-000000000000");
	Результат.Вставить("code", "");
	Результат.Вставить("userName", "");
	Результат.Вставить("testResults", Новый Массив);
	Результат.Вставить("analisysStartDate", "");
	Результат.Вставить("analisysEndDate", "");
	
	Возврат Результат;
	
КонецФункции

Функция СтатусПоСостояниюДокумента(ДанныеПробы, АнализПроведен)
		
	ТипПробы = ДанныеПробы.ТипПробы;
	ЭтоВыполененаПроба = АнализПроведен И СтатусЛабАнализаВыполненВыполняется(ДанныеПробы);
	
	Если ДанныеПробы.ТекущееСостояние = Перечисления.гкс_СостоянияРегистрации.ПринятыПробы Тогда		
		Статус = 1;
				
	ИначеЕсли ТипПробы = Перечисления.гкс_ТипыПроб.Единичная И ЭтоВыполененаПроба Тогда	
		Статус = 2;
					
	ИначеЕсли ТипПробы = Перечисления.гкс_ТипыПроб.Композитная Тогда
		
		Если ЭтоВыполененаПроба Тогда
			Статус = 5;
		Иначе
			Статус = 4;
		КонецЕсли;
		
	Иначе
		Статус  = 0;
	КонецЕсли;
		
	Возврат Статус;
	
КонецФункции

Функция СтатусЛабАнализаВыполненВыполняется(ДанныеПробы)

	Возврат ДанныеПробы.СтатусЛабАнализа = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен
		Или ДанныеПробы.СтатусЛабАнализа = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполняется;

КонецФункции

#КонецОбласти

#КонецОбласти
